DiffusiveMixing/H-mixer/90deg/cL20/U0.01/flowField/system/blockMeshDict
FoamFile
{
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}

convertToMeters 1;

vertices (
	(-0.00005 0 0)
	(0.00005 0 0)
	(0.00005 0.00195 0)
	(-0.00005 0.00195 0)
	(-0.00005 0.00205 0)
	(0.00005 0.00205 0)
	(0.00005 0.004 0)
	(-0.00005 0.004 0)
	(0.01995 0 0)
	(0.02005 0 0)
	(0.02005 0.00195 0)
	(0.01995 0.00195 0)
	(0.01995 0.00205 0)
	(0.02005 0.00205 0)
	(0.02005 0.004 0)
	(0.01995 0.004 0)
	(-0.00005 0 0.0001)
	(0.00005 0 0.0001)
	(0.00005 0.00195 0.0001)
	(-0.00005 0.00195 0.0001)
	(-0.00005 0.00205 0.0001)
	(0.00005 0.00205 0.0001)
	(0.00005 0.004 0.0001)
	(-0.00005 0.004 0.0001)
	(0.01995 0 0.0001)
	(0.02005 0 0.0001)
	(0.02005 0.00195 0.0001)
	(0.01995 0.00195 0.0001)
	(0.01995 0.00205 0.0001)
	(0.02005 0.00205 0.0001)
	(0.02005 0.004 0.0001)
	(0.01995 0.004 0.0001)
);

blocks (
	hex (0 1 2 3 16 17 18 19) (80 800 1) simpleGrading (1 1 1)
	hex (4 5 6 7 20 21 22 23) (80 800 1) simpleGrading (1 1 1)
	hex (8 9 10 11 24 25 26 27) (80 800 1) simpleGrading (1 1 1)
	hex (12 13 14 15 28 29 30 31) (80 800 1) simpleGrading (1 1 1)
	hex (2 11 12 5 18 27 28 21) (800 80 1) simpleGrading (1 1 1)
	hex (3 2 5 4 19 18 21 20) (80 80 1) simpleGrading (1 1 1)
	hex (11 10 13 12 27 26 29 28) (80 80 1) simpleGrading (1 1 1)
);

edges (
);

boundary (
	walls {
		type wall;
		faces (
			(1 2 17 18)
			(3 0 19 16)
			(5 6 21 22)
			(7 4 23 20)
			(9 10 25 26)
			(11 8 27 24)
			(13 14 29 30)
			(15 12 31 28)
			(2 11 18 27)
			(5 12 21 28)
			(3 4 19 20)
			(10 13 26 29)
		);
	}
	inlet_0 {
		type patch;
		faces (
			(0 1 16 17)
		);
	}
	inlet_1 {
		type patch;
		faces (
			(6 7 22 23)
		);
	}
	outlet_0 {
		type patch;
		faces (
			(8 9 24 25)
		);
	}
	outlet_1 {
		type patch;
		faces (
			(14 15 30 31)
		);
	}
);
